nvitya/vihal/rv64g/kendryte/K2/k210_vihal.h
/* -----------------------------------------------------------------------------
 * This file is a part of the VIHAL project: https://github.com/nvitya/vihal
 * Copyright (c) 2021 Viktor Nagy, nvitya
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 * --------------------------------------------------------------------------- */
/*
 *  file:     k210_vihal.h
 *  brief:    own kendryte K210 definitions, some definition copied from the Kendryte SDK
 *  created:  2022-07-22
 *  authors:  nvitya
*/

// Kendryte SDK Copyright:

/* Copyright 2018 Canaan Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */


#ifndef _K210_VIHAL_H
#define _K210_VIHAL_H

#include <cstddef>
#include "stdint.h"
#include "stdint.h"

/* Register base address */

/* Under Coreplex */
#define CLINT_BASE_ADDR     (0x02000000U)
#define PLIC_BASE_ADDR      (0x0C000000U)

/* Under TileLink */
#define UARTHS_BASE_ADDR    (0x38000000U)
#define GPIOHS_BASE_ADDR    (0x38001000U)

/* Under AXI 64 bit */
#define RAM_BASE_ADDR       (0x80000000U)
#define RAM_SIZE            (6 * 1024 * 1024U)

#define IO_BASE_ADDR        (0x40000000U)
#define IO_SIZE             (6 * 1024 * 1024U)

#define AI_RAM_BASE_ADDR    (0x80600000U)
#define AI_RAM_SIZE         (2 * 1024 * 1024U)

#define AI_IO_BASE_ADDR     (0x40600000U)
#define AI_IO_SIZE          (2 * 1024 * 1024U)

#define AI_BASE_ADDR        (0x40800000U)
#define AI_SIZE             (12 * 1024 * 1024U)

#define FFT_BASE_ADDR       (0x42000000U)
#define FFT_SIZE            (4 * 1024 * 1024U)

#define ROM_BASE_ADDR       (0x88000000U)
#define ROM_SIZE            (128 * 1024U)

/* Under AHB 32 bit */
#define DMAC_BASE_ADDR      (0x50000000U)

/* Under APB1 32 bit */
#define GPIO_BASE_ADDR      (0x50200000U)
#define UART1_BASE_ADDR     (0x50210000U)
#define UART2_BASE_ADDR     (0x50220000U)
#define UART3_BASE_ADDR     (0x50230000U)
#define SPI_SLAVE_BASE_ADDR (0x50240000U)
#define I2S0_BASE_ADDR      (0x50250000U)
#define I2S1_BASE_ADDR      (0x50260000U)
#define I2S2_BASE_ADDR      (0x50270000U)
#define I2C0_BASE_ADDR      (0x50280000U)
#define I2C1_BASE_ADDR      (0x50290000U)
#define I2C2_BASE_ADDR      (0x502A0000U)
#define FPIOA_BASE_ADDR     (0x502B0000U)
#define SHA256_BASE_ADDR    (0x502C0000U)
#define TIMER0_BASE_ADDR    (0x502D0000U)
#define TIMER1_BASE_ADDR    (0x502E0000U)
#define TIMER2_BASE_ADDR    (0x502F0000U)

/* Under APB2 32 bit */
#define WDT0_BASE_ADDR      (0x50400000U)
#define WDT1_BASE_ADDR      (0x50410000U)
#define OTP_BASE_ADDR       (0x50420000U)
#define DVP_BASE_ADDR       (0x50430000U)
#define SYSCTL_BASE_ADDR    (0x50440000U)
#define AES_BASE_ADDR       (0x50450000U)
#define RTC_BASE_ADDR       (0x50460000U)


/* Under APB3 32 bit */
#define SPI0_BASE_ADDR      (0x52000000U)
#define SPI1_BASE_ADDR      (0x53000000U)
#define SPI3_BASE_ADDR      (0x54000000U)

//------------------------------------------------------------------------------
// SYSCTL
//------------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t     GIT_ID;        // 0x00  Git short commit id
  volatile uint32_t     CLK_FREQ;      // 0x04  System clock base frequency
  volatile uint32_t     PLL0;          // 0x08  PLL0 controller
  volatile uint32_t     PLL1;          // 0x0c  PLL1 controller
  volatile uint32_t     PLL2;          // 0x10  PLL2 controller
  volatile uint32_t     RESV5;         // 0x14  Reserved
  volatile uint32_t     PLL_LOCK;      // 0x18  PLL lock tester
  volatile uint32_t     ROM_ERROR;     // 0x1c  AXI ROM detector
  volatile uint32_t     CLK_SEL0;      // 0x20  Clock select controller0
  volatile uint32_t     CLK_SEL1;      // 0x24  Clock select controller1
  volatile uint32_t     CLK_EN_CENT;   // 0x28  Central clock enable
  volatile uint32_t     CLK_EN_PERI;   // 0x2c  Peripheral clock enable
  volatile uint32_t     SOFT_RESET;    // 0x30  Soft reset ctrl
  volatile uint32_t     PERI_RESET;    // 0x34  Peripheral reset controller
  volatile uint32_t     CLK_TH0;       // 0x38  Clock threshold controller 0
  volatile uint32_t     CLK_TH1;       // 0x3c  Clock threshold controller 1
  volatile uint32_t     CLK_TH2;       // 0x40  Clock threshold controller 2
  volatile uint32_t     CLK_TH3;       // 0x44  Clock threshold controller 3
  volatile uint32_t     CLK_TH4;       // 0x48  Clock threshold controller 4
  volatile uint32_t     CLK_TH5;       // 0x4c  Clock threshold controller 5
  volatile uint32_t     CLK_TH6;       // 0x50  Clock threshold controller 6
  volatile uint32_t     MISC;          // 0x54  Miscellaneous controller
  volatile uint32_t     PERI;          // 0x58  Peripheral controller
  volatile uint32_t     SPI_SLEEP;     // 0x5c  SPI sleep controller
  volatile uint32_t     RESET_STATUS;  // 0x60  Reset source status
  volatile uint32_t     DMA_SEL0;      // 0x64  DMA handshake selector
  volatile uint32_t     DMA_SEL1;      // 0x68  DMA handshake selector
  volatile uint32_t     POWER_SEL;     // 0x6c  IO Power Mode Select controller
  volatile uint32_t     RESV28;        // 0x70  Reserved
  volatile uint32_t     RESV29;        // 0x74  Reserved
  volatile uint32_t     RESV30;        // 0x78  Reserved
  volatile uint32_t     RESV31;        // 0x7c  Reserved
//
} sysctl_regs_t;


#define SYSCTL_CLK_EN_CENT_CPU     (1 << 0)
#define SYSCTL_CLK_EN_CENT_SRAM0   (1 << 1)
#define SYSCTL_CLK_EN_CENT_SRAM1   (1 << 2)
#define SYSCTL_CLK_EN_CENT_APB0    (1 << 3)
#define SYSCTL_CLK_EN_CENT_APB1    (1 << 4)
#define SYSCTL_CLK_EN_CENT_APB2    (1 << 5)

#define SYSCTL_CLK_EN_PERI_ROM     (1 <<  0)
#define SYSCTL_CLK_EN_PERI_DMA     (1 <<  1)
#define SYSCTL_CLK_EN_PERI_AI      (1 <<  2)
#define SYSCTL_CLK_EN_PERI_DVP     (1 <<  3)
#define SYSCTL_CLK_EN_PERI_FFT     (1 <<  4)
#define SYSCTL_CLK_EN_PERI_GPIO    (1 <<  5)
#define SYSCTL_CLK_EN_PERI_SPI0    (1 <<  6)
#define SYSCTL_CLK_EN_PERI_SPI1    (1 <<  7)
#define SYSCTL_CLK_EN_PERI_SPI2    (1 <<  8)
#define SYSCTL_CLK_EN_PERI_SPI3    (1 <<  9)
#define SYSCTL_CLK_EN_PERI_I2S0    (1 << 10)
#define SYSCTL_CLK_EN_PERI_I2S1    (1 << 11)
#define SYSCTL_CLK_EN_PERI_I2S2    (1 << 12)
#define SYSCTL_CLK_EN_PERI_I2C0    (1 << 13)
#define SYSCTL_CLK_EN_PERI_I2C1    (1 << 14)
#define SYSCTL_CLK_EN_PERI_I2C2    (1 << 15)
#define SYSCTL_CLK_EN_PERI_UART1   (1 << 16)
#define SYSCTL_CLK_EN_PERI_UART2   (1 << 17)
#define SYSCTL_CLK_EN_PERI_UART3   (1 << 18)
#define SYSCTL_CLK_EN_PERI_AES     (1 << 19)
#define SYSCTL_CLK_EN_PERI_FPIOA   (1 << 20)
#define SYSCTL_CLK_EN_PERI_TIMER0  (1 << 21)
#define SYSCTL_CLK_EN_PERI_TIMER1  (1 << 22)
#define SYSCTL_CLK_EN_PERI_TIMER2  (1 << 23)
#define SYSCTL_CLK_EN_PERI_WDT0    (1 << 24)
#define SYSCTL_CLK_EN_PERI_WDT1    (1 << 25)
#define SYSCTL_CLK_EN_PERI_SHA     (1 << 26)
#define SYSCTL_CLK_EN_PERI_OTP     (1 << 27)
// 28 reserved
#define SYSCTL_CLK_EN_PERI_RTC     (1 << 29)



//------------------------------------------------------------------------------
// FPIOA
//------------------------------------------------------------------------------

#define FPIOA_NUM_IO    (48)

